app/views/name/index.html.erb

SELECT "names".* FROM "names"
SELECT COUNT(*) FROM "names"
---
<h1>hello World!</h1>
<h2><%=Name.count%></h2>