app/controllers/name_controller.rb

  def index
    @names = Name.all
---
SELECT "names".* FROM "names"